[
  {
    "role": "React.js  Developer",
    "organisation": "Sigma Software Solutions Pvt Ltd - Bangalore",
    "startDate": "Jan, 2023",
    "endDate": "Present",
    "experiences": ["Client : 'CGI' Working on MyAster Web App", "As the UI developer I assumed complete ownership of the User Interface (UI) and effectively managed the UI thread in collaboration,with 4 developers to ensure a superior user experience for MyAster users","In my  web application i Utilized Redux for state management and implemented action creators, action types, and reducers to facilitate structured and predictable data flow within the application","Demonstrated proficiency in error handling and recovery, ensuring robust performance and smooth user experience by managing network errors and handling API-specific errors gracefully","Successfully optimized a React.js web application by implementing React lazy loading techniques, significantly improving page load times and overall user experience","Developed and maintained Unit Test Cases using Jest and React Testing Library, resulting in a 30% reduction in production defects.","Collaborated with developers to enhance test coverage of critical components by 80%, facilitating early issue identification and resolution","Efficiently delivered and deployed a web application, reaching a vast audience of 120 million Users."]
  },{
    "role": "React.js Developer",
    "organisation": "Tech Mahindra",
    "startDate": "Dec, 2021",
    "endDate": "Jan,2023",
    "experiences": ["Worked  on  CheffyHub App", "Developed andmaintained responsive userinterfaces using ReactJS, HTML5, CSS3, and JavaScript,ensuring optimal performance across devices and browsers.","Builtreusable andmodular components using React, focusing on scalability andmaintainability oftheapplication’s codebase.","Implements RESTful APIsfor communication with the front end.","Wrote unit and integration tests using Jest and React Testing Library (RTL), ensuring the application’s functionality, stability, and high code quality","Managed application state with Redux, utilizing Redux-Thunk for handling asynchronous actions and ensuring smooth data flow across components.","ImplementsRESTful APIsfor communication with the front end.","Collaborateswith developersto enhance query performance and database optimization.","Implemented responsive web designs using frameworkslike Bootstrap,Material-UI, and custom CSS,ensuring optimal viewing experiences across various devices and screen sizes."]
  }
]
